app/Controllers/Admin/Dashboard.php

    public function index()
    {
        if (!session()->get('logged_in')) {
            return redirect()->to('/adminlogin');
        }
        $today = date('Y-m-d');
        $thisMonth = date('m');
        $thisYear = date('Y');

        // Ambil data asli
        $totalAnggota = $this->anggotaModel->countAll();
        $jumlahKelas = $this->kelasModel->countAll();

        $menungguHariIni = $this->anggotaModel
        ->where('status', 'menunggu')
        ->where('DATE(tgl_daftar)', $today)
        ->countAllResults();

        $aktifBulanIni = $this->anggotaModel
        ->where('status', 'aktif')
        ->where('MONTH(tgl_daftar)', $thisMonth)
        ->where('YEAR(tgl_daftar)', $thisYear)
        ->countAllResults();

        $anggotaLaki = $this->anggotaModel
            ->where(['status' => 'Aktif', 'jenis_kelamin' => 'Laki-laki'])
            ->countAllResults();
        $anggotaPerempuan = $this->anggotaModel
            ->where(['status' => 'Aktif', 'jenis_kelamin' => 'Perempuan'])
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows` FROM `anggota`
SELECT COUNT(*) AS `numrows` FROM `kelas`
SELECT COUNT(*) AS `numrows`
FROM `anggota`
WHERE `status` = 'menunggu'
AND DATE(tgl_daftar) = '2026-01-14'
SELECT COUNT(*) AS `numrows`
FROM `anggota`
WHERE `status` = 'aktif'
AND MONTH(tgl_daftar) = '01'
AND YEAR(tgl_daftar) = '2026'
SELECT COUNT(*) AS `numrows`
FROM `anggota`
WHERE `status` = 'Aktif'
AND `jenis_kelamin` = 'Laki-laki'
SELECT COUNT(*) AS `numrows`
FROM `anggota`
WHERE `status` = 'Aktif'
AND `jenis_kelamin` = 'Perempuan'