app/Controllers/Admin/Kehadiran.php

    public function index()
{
    // Tangkap input dari URL (GET)
    $bulan = $this->request->getGet('bulan') ?? date('m');
    $tahun = $this->request->getGet('tahun') ?? date('Y');

    $anggota = $this->anggotaModel->select('anggota.*, kelas.nama_kelas')
        ->join('kelas', 'kelas.id_kelas = anggota.id_kelas', 'left')
        ->where('anggota.status', 'aktif')
        ->findAll();
---
SELECT `anggota`.*, `kelas`.`nama_kelas`
FROM `anggota`
LEFT JOIN `kelas` ON `kelas`.`id_kelas` = `anggota`.`id_kelas`
WHERE `anggota`.`status` = 'aktif'

    public function create()
    {
        $data = [
            'title' => 'Tambah Data Kehadiran',
            'anggota' => $this->anggotaModel->select('anggota.*, kelas.nama_kelas')
                        ->join('kelas', 'kelas.id_kelas = anggota.id_kelas', 'left')
                        ->where('anggota.status', 'aktif')
                        ->findAll(),
---
SELECT `anggota`.*, `kelas`.`nama_kelas`
FROM `anggota`
LEFT JOIN `kelas` ON `kelas`.`id_kelas` = `anggota`.`id_kelas`
WHERE `anggota`.`status` = 'aktif'

    public function detail($id_anggota)
{
    $bulan = $this->request->getGet('bulan');
    $tahun = $this->request->getGet('tahun');

    $anggota = $this->anggotaModel->select('anggota.*, kelas.nama_kelas')
        ->join('kelas', 'kelas.id_kelas = anggota.id_kelas', 'left')
        ->find($id_anggota);
---
SELECT `anggota`.*, `kelas`.`nama_kelas`
FROM `anggota`
LEFT JOIN `kelas` ON `kelas`.`id_kelas` = `anggota`.`id_kelas`
WHERE `anggota`.`id_anggota` = '26.A01.001'