app/Controllers/Admin/Pelatih.php

SELECT *
FROM `pelatih`
---
    public function index()
    {
        $data['title'] = 'Data Pelatih';
        $data['pelatih'] = $this->pelatihModel->findAll();