app/Controllers/Login.php

SELECT *
FROM `user`
WHERE `username` = 'admin'
 LIMIT 1
---
    public function auth()
{
    $session = session();
    $model = new UserModel();
    $anggotaModel = new AnggotaModel(); // Tambahkan model anggota

    $username = $this->request->getPost('username');
    $password = $this->request->getPost('password');

    // Cari user di tabel 'user' berdasarkan username
    $user = $model->where('username', $username)->first();