app/Models/DetailKehadiranModel.php

SELECT `id_detail`
FROM `detail_kehadiran`
WHERE `id_detail` LIKE 'DK20260114%' ESCAPE '!'
ORDER BY `id_detail` DESC
 LIMIT 1
---
    public function generateIdDetail()
{
    $tanggal = date('Ymd');
    $prefix = "DK" . $tanggal;

    $lastId = $this->db->table('detail_kehadiran')
                       ->select('id_detail')
                       ->like('id_detail', $prefix, 'after')
                       ->orderBy('id_detail', 'DESC')
                       ->limit(1)
                       ->get()
                       ->getRowArray();

SELECT COUNT(*) AS `numrows`
FROM `detail_kehadiran`
WHERE `id_anggota` = '26.A01.001'
AND `status_kehadiran` = 'hadir'
SELECT COUNT(*) AS `numrows`
FROM `detail_kehadiran`
WHERE `id_anggota` = '26.A01.001'
AND `status_kehadiran` IN ('sakit','izin','tidak hadir')
---
public function getRekapPerAnggota($id_anggota, $bulan = null, $tahun = null)
{
    // Query untuk Hadir
    $hadirBuilder = $this->db->table($this->table)
        ->where('id_anggota', $id_anggota)
        ->where('status_kehadiran', 'hadir');

    // Query untuk Tidak Hadir (Sakit, Izin, Tanpa Keterangan)
    $tidakHadirBuilder = $this->db->table($this->table)
        ->where('id_anggota', $id_anggota)
        ->whereIn('status_kehadiran', ['sakit', 'izin', 'tidak hadir']);

    // Terapkan filter Tanggal jika ada
    if ($bulan) {
        // Casting ke integer agar '01' menjadi 1 sesuai output MONTH() SQL
        $hadirBuilder->where("MONTH(tanggal_pertemuan)", (int)$bulan);
        $tidakHadirBuilder->where("MONTH(tanggal_pertemuan)", (int)$bulan);
    }
    if ($tahun) {
        $hadirBuilder->where("YEAR(tanggal_pertemuan)", $tahun);
        $tidakHadirBuilder->where("YEAR(tanggal_pertemuan)", $tahun);
    }

    return [
        'total_hadir'       => $hadirBuilder->countAllResults(),
        'total_tidak_hadir' => $tidakHadirBuilder->countAllResults()
    ];