app/Models/InfoPendaftaranModel.php

SELECT *
FROM `info_pendaftaran`
WHERE `status` = 'aktif'
ORDER BY `tgl_akhir_daftar` DESC
 LIMIT 1
---
    public function getActiveInfo()
    {
        return $this->where('status', 'aktif')
                    ->orderBy('tgl_akhir_daftar', 'DESC') // Ambil yang paling baru jika ada beberapa yang aktif
                    ->first();