app/Models/JadwalModel.php

SELECT `kelas`.*, `pelatih`.`nama` as `nama_pelatih`
FROM `kelas`
LEFT JOIN `pelatih` ON `pelatih`.`id_pelatih` = `kelas`.`id_pelatih`
SELECT COUNT(*) AS `numrows`
FROM `anggota`
WHERE `id_kelas` = 'KA001'
---
    public function getJadwal()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('kelas');
        $builder->select('kelas.*, pelatih.nama as nama_pelatih');
        $builder->join('pelatih', 'pelatih.id_pelatih = kelas.id_pelatih', 'left');
        $kelasList = $builder->get()->getResultArray();

        // Tambahkan jumlah anggota otomatis per kelas
        foreach ($kelasList as &$kelas) {
            $count = $db->table('anggota')
                ->where('id_kelas', $kelas['id_kelas']) // <-- PERBAIKAN: Filter berdasarkan ID Kelas!
                ->countAllResults();

SELECT *
FROM `anggota`
WHERE `id_kelas` = 'KA001'
---
    public function getAnggotaByKelas($kelas)
    {
        $db = \Config\Database::connect();
        return $db->table('anggota')
            ->where('id_kelas', $kelas['id_kelas'])

SELECT `kelas`.*, `pelatih`.`nama` AS `nama_pelatih`
FROM `kelas`
JOIN `pelatih` ON `pelatih`.`id_pelatih` = `kelas`.`id_pelatih`
WHERE `kelas`.`id_kelas` = 'KA001'
---
    public function getKelasWithPelatih($id_kelas)
    {
        return $this->db->table('kelas')
            ->select('kelas.*, pelatih.nama AS nama_pelatih')
            ->join('pelatih', 'pelatih.id_pelatih = kelas.id_pelatih')
            ->where('kelas.id_kelas', $id_kelas)
            ->get()
            ->getRowArray();