app/Models/JadwalKelasModel.php

    public function getJadwalDenganKelas()
    {
        return $this->db->table('jadwal_kelas')
        ->select('jadwal_kelas.*, kelas.nama_kelas, kelas.tipe_kelas')
        ->join('kelas', 'kelas.id_kelas = jadwal_kelas.id_kelas')
        ->orderBy('kelas.tipe_kelas', 'ASC')
        ->get()
        ->getResultArray();
---
SELECT `jadwal_kelas`.*, `kelas`.`nama_kelas`, `kelas`.`tipe_kelas`
FROM `jadwal_kelas`
JOIN `kelas` ON `kelas`.`id_kelas` = `jadwal_kelas`.`id_kelas`
ORDER BY `kelas`.`tipe_kelas` ASC