app/Models/KehadiranModel.php

SELECT `id_rekap`
FROM `rekap_kehadiran`
WHERE `id_rekap` LIKE 'RK20260114%' ESCAPE '!'
ORDER BY `id_rekap` DESC
 LIMIT 1
---
    public function generateIdRekap()
    {
        $tanggal = date('Ymd'); // Hasil: 20251218
        $prefix = "RK" . $tanggal; // Hasil: RK20251218

        // Cari ID terakhir yang depannya RK20251218
        $lastId = $this->db->table('rekap_kehadiran')
                           ->select('id_rekap')
                           ->like('id_rekap', $prefix, 'after')
                           ->orderBy('id_rekap', 'DESC')
                           ->limit(1)
                           ->get()
                           ->getRowArray();