app/Models/KelasModel.php

SELECT `kelas`.*, `pelatih`.`nama` as `nama_pelatih`
FROM `kelas`
JOIN `pelatih` ON `pelatih`.`id_pelatih` = `kelas`.`id_pelatih`
---
    public function getKelasWithPelatih()
    {
        return $this->select('kelas.*, pelatih.nama as nama_pelatih')
                    ->join('pelatih', 'pelatih.id_pelatih = kelas.id_pelatih')
                    ->findAll();